# RebarElementVisibility Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarElementVisibility Property
ParameterTypeId Class See Also
---
"View Visibility States"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarElementVisibility { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarElementVisibility As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarElementVisibility {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace